transformation-library/src/main/resources/templates/qc/PATIENT_CONSENT-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:hl7-org:v3">
    <soapenv:Header>
        <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wsswssecurity-secext-1.0.xsd"
                  soapenv:actor="IntervenantEmetteur"/>
    </soapenv:Header>
    <soapenv:Body Id="_0">
        <RCMR_IN010996CAQC_V01 xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                               th:if="${phmsRequest}" ITSVersion="XML_1.0"
                               th:with="transmissionWrapper=${phmsRequest.requestBodyTransmissionWrapper}">
            <!-- ******* Beginning of Transport Wrapper ******* -->
            <id th:if="${transmissionWrapper}" th:root="${transmissionWrapper.transmissionUniqueIdentifier}"/>
            <creationTime th:if="${transmissionWrapper}"
                          th:value="${transmissionWrapper.transmissionCreationDateTime}"/>
            <responseModeCode code="I"/>
            <versionCode code="NE2006"/>
            <interactionId root="2.16.124.10.101.1.60.3.19" extension="RCMR_IN010996CAQC_V01" displayable="true"/>
            <processingCode th:if="${transmissionWrapper}" th:code="${transmissionWrapper.processingCode}"/>
            <processingModeCode code="T"/>
            <acceptAckCode code="AL"/>
            <receiver typeCode="RCV">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.124.10.101.1.60.2.12" extension="FCO" use="BUS"/>
                </device>
            </receiver>
            <sender typeCode="SND" th:if="${transmissionWrapper}">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id th:root="${transmissionWrapper.senderRoot}"
                        th:extension="${transmissionWrapper.senderApplicationId}" use="BUS"/>
                    <name representation="TXT" mediaType="text/plain"
                          th:text="${transmissionWrapper.senderApplicationName}"/>
                </device>
            </sender>
            <!-- ******* END OF Transport Wrapper ******* -->
            <!-- ******* Beginning of Control Act ******* -->
            <controlActEvent classCode="CACT" moodCode="EVN" th:if="${phmsRequest.requestControlAct}"
                             th:with="controlAct=${phmsRequest.requestControlAct}">
                <id th:root="${controlAct.eventRoot}" th:extension="${controlAct.eventCorrelationId}" use="BUS"/>
                <code code="RCMR_TE010996CA"/>
                <statusCode code="completed"/>
                <recordTarget typeCode="RCT" contextControlCode="AP">
                    <patient1 classCode="PAT" th:if="${phmsRequest.provincialRequestPayload}"
                              th:with="criteria=${phmsRequest.provincialRequestPayload}">
                        <id root="2.16.840.1.113883.4.56" th:extension="${criteria.patientIdentifier}"/>
                        <patientPerson classCode="PSN" determinerCode="INSTANCE">
                            <name th:if="${criteria.firstName != null or criteria.lastName != null}">
                                <family representation="TXT" mediaType="text/plain" partType="FAM"
                                        th:text="${criteria.lastName}"></family>
                                <given representation="TXT" mediaType="text/plain" partType="GIV"
                                       th:text="${criteria.firstName}"></given>
                            </name>
                        </patientPerson>
                    </patient1>
                </recordTarget>
                <!-- ******* Beginning of Payload ******* -->
                <queryByParameter th:if="${phmsRequest.provincialRequestPayload}"
                                  th:with="criteria=${phmsRequest.provincialRequestPayload}">
                    <queryId th:if="${transmissionWrapper}"
                             th:root="${transmissionWrapper.transmissionUniqueIdentifier}"/>
                    <parameterList>
                        <clientID th:if="${criteria.patientIdentifier}">
                            <value root="2.16.840.1.113883.4.56" th:extension="${criteria.patientIdentifier}"/>
                        </clientID>
                        <code code="DS"/>
                        <effectiveTime th:if="${criteria.effectiveDateTime}">
                            <high th:value="${criteria.effectiveDateTime}"/>
                        </effectiveTime>
                    </parameterList>
                </queryByParameter>
                <!-- ******* END OF of Payload ******* -->
            </controlActEvent>
            <!-- ******* END OF Control Act ******* -->
        </RCMR_IN010996CAQC_V01>
    </soapenv:Body>
</soapenv:Envelope>